dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
    handle->state = I2C_READ_REGISTER;                // Set the I2C bus state to read register mode
    handle->rxBuffer = data;                          // Set the receive buffer pointer
    handle->rxBufferSize = length;                    // Set the receive buffer size
    handle->rxBufferIndex = 0;                        // Reset the receive buffer index
    setupDeviceAddress(handle, deviceAddress, false); // Setup the device address
    PIE7bits.I2C1TXIE = 1;                            // Enable the transmit interrupt
    I2C1TXB = registerAddress; // Load the register address into the transmit buffer
    I2C1CNT = 1;               // Set the I2C count register to 1 (for the register address)
    // Disable repeated start condition (it will be enabled after the write phase in the ISR)
    I2C1CON0bits.RSEN = 0;
    I2C1CON0bits.EN = 1; // Enable the I2C module
    I2C1CON0bits.S = 1;  // Generate a start condition

    handle->lastState = I2C_OK; // Set the last state to OK
    return I2C_OK; // Return success status (actual read register implementation is not provided)
}

/// @brief Reset the I2C module.  This function resets the I2C module by clearing all interrupts
/// and resetting any operations in progress.  The function is defined as follows:
I2C_Status_t I2C_Reset(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }

    // Reset the I2C module based on the channel
    if (handle->channel == I2C_CHANNEL_1)
    {
        CRITICAL_SECTION_START();
        I2C1CON0bits.S = 0;    // Clear the start condition bit
        I2C1CON0bits.EN = 0;   // Disable the I2C module
        PIR7bits.I2C1EIF = 0;  // Clear the I2C1 error interrupt flag
        PIR7bits.I2C1IF = 0;   // Clear the I2C1 general interrupt flag
        PIR7bits.I2C1TXIF = 0; // Clear the I2C1 transmit interrupt flag
        PIR7bits.I2C1RXIF = 0; // Clear the I2C1 receive interrupt flag
        I2C1PIR = 0;           // Clear I2C1 interrupt flags
        I2C1ERR = 0;           // Clear I2C1 error flags
        I2C1CNT = 0;           // Reset I2C1 count register

        handle->state = I2C_IDLE;   // Set the I2C bus state to idle
        handle->lastState = I2C_OK; // Set the last state to OK
        CRITICAL_SECTION_END();
        return I2C_OK;
    }

    return I2C_INVALID_CHANNEL;
}

/// @brief Validate the I2C handle structure.  This function checks the signature of the
/// I2C handle structure to ensure that it is valid.  The function returns true if
/// the handle is valid, and false if the handle is invalid.  The function is defined as
/// follows:
static bool isHandleValid(I2C_Handle_t* handle)
{
    if (handle == NULL)
    {
        return false; // Handle is NULL, not valid
    }
    if (handle->signature != I2C_HANDLE_SIGNATURE)
    {
        return false; // Handle signature does not match, not valid
    }
    return true; // Handle is valid
}

/// @brief Setup the I2C device address for read or write operation.  This function sets
/// the I2C device address in the appropriate register based on the I2C channel and the
/// read/write operation.  The function is defined as follows:
static void setupDeviceAddress(I2C_Handle_t* handle, uint16_t deviceAddress, bool read)
{
    uint8_t addressHigh = (deviceAddress >> 8) & 0x03; // Get the upper 2 bits for 10-bit addressing
    uint8_t addressLow = deviceAddress & 0xFF;         // Get the lower 8 bits for 10-bit addressing
    if (read)
    {
        addressLow |= 0x01; // Set the read/write bit for read operation
    }
    else
    {
        addressLow &= ~0x01; // Clear the read/write bit for write operation
    }

#ifdef I2C1CON0
    if (handle->channel == I2C_CHANNEL_1)
    {
        switch (handle->mode)
        {
        case I2C_MODE_MASTER_7:
        case I2C_MULTI_MASTER_7:
            I2C1ADB1 = addressLow; // Set the 7-bit address in the ADB1 register
            break;
        case I2C_MODE_MASTER_10:
        case I2C_MULTI_MASTER_10:
            I2C1ADB1 = addressLow;  // Set the lower 8 bits for 10-bit addressing
            I2C1ADB0 = addressHigh; // Set the upper 2 bits for 10-bit addressing
            break;
        default:
            handle->lastState = I2C_INVALID_MODE; // Set the last state to invalid mode
            return;                               // Invalid mode, exit the function
        }
    }
#endif
#ifdef I2C2CON0
    if (handle->channel == I2C_CHANNEL_2)
    {
        switch (handle->mode)
        {
        case I2C_MODE_MASTER_7:
        case I2C_MULTI_MASTER_7:
            I2C2ADB1 = addressLow; // Set the 7-bit address in the ADB1 register
            break;
        case I2C_MODE_MASTER_10:
        case I2C_MULTI_MASTER_10:
            I2C2ADB1 = addressLow;  // Set the lower 8 bits for 10-bit addressing
            I2C2ADB0 = addressHigh; // Set the upper 2 bits for 10-bit addressing
            break;
        default:
            handle->lastState = I2C_INVALID_MODE; // Set the last state to invalid mode
            return;                               // Invalid mode, exit the function
        }
    }
#endif
}

/// @brief Handle I2C error interrupts.  This function checks the I2C error interrupt flags
/// and updates the I2C handle structure with the appropriate error state.
/// @param handle Pointer to the I2C handle structure.
/// @return None
static void handleErrorInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

#ifdef I2C1CON0
    if (handle->channel == I2C_CHANNEL_1)
    {
        // Check for bus timeout error
        if (I2C1ERRbits.BTOIF)
        {
            I2C1ERRbits.BTOIF = 0;               // Clear the bus timeout interrupt flag
            handle->lastState = I2C_BUS_TIMEOUT; // Set the last state to bus timeout
            handle->state = I2C_IDLE;            // Set the I2C bus state to idle
        }

        // Check for bus collision error
        if (I2C1ERRbits.BCLIF)
        {
            I2C1ERRbits.BCLIF = 0;                 // Clear the bus collision interrupt flag
            handle->lastState = I2C_BUS_COLLISION; // Set the last state to bus collision
            handle->state = I2C_IDLE;              // Set the I2C bus state to idle
        }

        // Check for NACK received error
        if (I2C1ERRbits.NACKIF)
        {
            I2C1ERRbits.NACKIF = 0; // Clear the NACK interrupt flag
            handle->lastState =
                (I2C_Status_t)I2C_NACK_RECEIVED; // Set the last state to NACK received
            handle->state = I2C_IDLE;            // Set the I2C bus state to idle
        }
    }
#endif
}

/// @brief Handle I2C receive interrupts.  This function reads the received data from the
/// I2C receive buffer and stores it in the I2C handle structure.
/// @param handle Pointer to the I2C handle structure.
/// @return None
void handleReceiveInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

#ifdef I2C1CON0
    if (handle->channel == I2C_CHANNEL_1)
    {
        uint8_t data = I2C1RXB; // Read the receive buffer to clear the interrupt flag
        if (handle->state != I2C_READ)
        {
            return; // Not in read mode, exit the ISR
        }

        if (handle->rxBufferIndex < handle->rxBufferSize - 1)
        {
            handle->rxBuffer[handle->rxBufferIndex++] = data;
        }
    }
#endif
}

