dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
/// @brief Handle I2C transmit interrupts.  This function writes the next byte of data to the
/// I2C transmit buffer and updates the I2C handle structure.  If all data has been transmitted,
/// the function disables the transmit interrupt and sets the I2C bus state to idle.  If the
/// function is in read register mode, it switches to read mode after the write phase and enables
/// the receive interrupt.
/// @param handle Pointer to the I2C handle structure.
/// @return None
void handleTransmitInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

    if (handle->state != I2C_WRITE)
    {
        return; // Not in write mode, exit the ISR
    }
    if (handle->txBufferIndex < handle->txBufferSize - 1)
    {
        // There is data to transmit
        I2C1TXB =
            handle
                ->txBuffer[handle->txBufferIndex++]; // Load the next byte into the transmit buffer
    }
    else
    {
        if (handle->state == I2C_READ_REGISTER)
        {
            // If we are in read register mode, we need to switch to read mode after the write phase
            handle->state = I2C_READ; // Switch to read mode
            PIE7bits.I2C1RXIE = 1;    // Enable the receive interrupt
            I2C1CNT =
                (uint8_t)handle
                    ->rxBufferSize; // Set the I2C count register to the number of bytes to receive
            I2C1CON0bits.RSEN = 1;  // Enable repeated start condition
            I2C1CON0bits.S = 1;     // Generate a start condition for the read phase
        }

        // No more data to transmit, disable the transmit interrupt and set the bus state to idle
        PIE7bits.I2C1TXIE = 0;    // Disable the transmit interrupt
        handle->state = I2C_IDLE; // Set the bus state to idle
    }
}